---
type: Units
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# Units

`Autodesk.Revit.DB.Units` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | Units | 2014 | `public Units ( UnitSystem unitSystem )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetFormatOptions | 2014 | `public FormatOptions GetFormatOptions ( ForgeTypeId specTypeId )` |
| Method | GetModifiableSpecs | 2014 | `public static IList < ForgeTypeId > GetModifiableSpecs ()` |
| Method | IsModifiableSpec | 2014 | `public static bool IsModifiableSpec ( ForgeTypeId specTypeId )` |
| Method | SetFormatOptions | 2014 | `public void SetFormatOptions ( ForgeTypeId specTypeId , FormatOptions options )` |
| Property | DecimalSymbol | 2014 | `public DecimalSymbol DecimalSymbol { get ; set ; }` |
| Property | DigitGroupingAmount | 2014 | `public DigitGroupingAmount DigitGroupingAmount { get ; set ; }` |
| Property | DigitGroupingSymbol | 2014 | `public DigitGroupingSymbol DigitGroupingSymbol { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |